/**
 ****************************************************************************************************					 
 * @file        delay.h
 * @version     V1.1
 * @brief       使用SysTick的普通计数模式对延迟进行管理(支持OS)
 *              提供delay_init初始化函数，delay_us和delay_ms等延时函数 
 ****************************************************************************************************
 *
 * V1.1
 * 修改SYS_SUPPORT_OS部分代码, 默认仅支持UCOSII 2.93.01版本, 其他OS请参考实现
 * 修改delay_init使用系统时钟
 * 修改delay_us使用时钟摘取法延时, 兼容OS
 * 修改delay_ms直接使用delay_us延时实现.
 *
 ****************************************************************************************************
 */
 
#ifndef __DELAY_H
#define __DELAY_H

#include "sys.h"



/*******************************************************************************
* Function Name  : delay_us
* Description    : 微秒延时函数，延时nus
* Input          : nus:微秒延时的个数
* Output         : None
* Return         : None
* Note			 : 400MHz下us延时函数
*******************************************************************************/
void delay_us(uint32_t nus);

/*******************************************************************************
* Function Name  : delay_ms
* Description    : 毫秒延时函数，延时nms
* Input          : nms:毫秒延时的个数
* Output         : None
* Return         : None
* Note			 : 168MHz下ms延时函数
*******************************************************************************/
void delay_ms(uint32_t ms);

/*******************************************************************************
* Function Name  : delay_ns
* Description    : ns级延时函数
* Input          : None
* Output         : None
* Return         : None
* Note			 : 400MHz下ns延时函数
*******************************************************************************/
void delay_ns(void);


#endif

